БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаПодписывающиеДокументы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжностьАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыЛицПодписывающихДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияИмяАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРус;
	_ВыделитьКнопкуЯзыка("RU");
	ПроверитьАнглФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Сообщить("Поле ""Организация"" не заполнено");
		Отказ = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Запись.Руководитель) Тогда
		Сообщить("Поле ""Руководитель"" не заполнено");
		Отказ = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Запись.ГлБухгалтер) Тогда
		Сообщить("Поле ""Главный бухгалтер"" не заполнено");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура RU(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРус;
	_ВыделитьКнопкуЯзыка("RU");
	
КонецПроцедуры

&НаКлиенте
Процедура EN(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАнгл;
	_ВыделитьКнопкуЯзыка("EN");
	ПроверитьАнглФИО();
	
КонецПроцедуры

&НаСервере
Процедура _ВыделитьКнопкуЯзыка(Язык)
	
	ЦветФона = Новый Цвет(83,106,194);
	ЦветТекста = WebЦвета.Белый;
	
	Элементы.RU.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	Элементы.EN.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	Элементы.RU.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	Элементы.EN.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	
	Если Язык = "RU" Тогда
		Элементы.RU.ЦветФона = ЦветФона;
		Элементы.RU.ЦветТекста = ЦветТекста;
	ИначеЕсли Язык = "EN" Тогда
		Элементы.EN.ЦветФона = ЦветФона;
		Элементы.EN.ЦветТекста = ЦветТекста;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительАнглПриИзменении(Элемент)
	
	ПроверитьАнглФИО();

КонецПроцедуры

&НаКлиенте
Процедура ГлБухгалтерАнглПриИзменении(Элемент)
	
	ПроверитьАнглФИО();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАнглФИО()
	
	Если ЗначениеЗаполнено(Запись.Руководитель) Тогда 
		Стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.Руководитель);
		Если ЗначениеЗаполнено(Стр) Тогда 
			Элементы.РукАнгл.Заголовок = Стр;
		Иначе 
			Элементы.РукАнгл.Заголовок = "(задать)";
		КонецЕсли;
	Иначе 
		Элементы.РукАнгл.Заголовок = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ГлБухгалтер) Тогда 
		Стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.ГлБухгалтер);
		Если ЗначениеЗаполнено(Стр) Тогда 
			Элементы.ГлБухАнгл.Заголовок = Стр;
		Иначе 
			Элементы.ГлБухАнгл.Заголовок = "(задать)";
		КонецЕсли;
	Иначе 
		Элементы.ГлБухАнгл.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура РукАнглНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Руководитель) Тогда
		ОткрытьФорму("РегистрСведений.CW_ПараметрыСотрудников.ФормаЗаписи", _ПФРСПСФЗ(Запись.Руководитель), Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПроверитьАнглФИО();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГлБухАнглНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ГлБухгалтер) Тогда	
		ОткрытьФорму("РегистрСведений.CW_ПараметрыСотрудников.ФормаЗаписи", _ПФРСПСФЗ(Запись.ГлБухгалтер), Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПроверитьАнглФИО();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ПФРСПСФЗ(сотр)

	Рег = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьМенеджерЗаписи();
	Рег.Сотрудник = сотр;
	Рег.Прочитать();
	Если НЕ Рег.Выбран() Тогда
		Рег.Сотрудник = сотр;
		рег.Записать();
	КонецЕсли;	

	КлючЗаписи = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьКлючЗаписи(Новый Структура("Сотрудник", сотр));
	Возврат Новый Структура("Ключ", КлючЗаписи);

КонецФункции
